src/DataProcessors/РабочееМестоКанбанЧЭ_Производство/РабочееМестоКанбанЧЭ_Производство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоКанбанЧЭ_Производство</name>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственноеЗадание</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/DataProcessors/РабочееМестоКанбанЧЭ_Производство/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
ОписаниеОшибки = "";
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
   Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
      ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
      ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , ОписаниеОшибки);
      Сообщить(ТекстСообщения);
   КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
КонецПроцедуры

&НаСервере
Процедура ОчиститьСсылкуНаПЗ()
Объект.ПроизводственноеЗадание = Документы.ПроизводственноеЗадание.ПустаяСсылка();
Объект.РабочееМесто = Справочники.РабочиеМестаЛинеек.ПустаяСсылка();
Объект.Исполнитель = Справочники.Сотрудники.ПустаяСсылка();
КонецПроцедуры 

&НаСервере
Функция ПолучитьКодРабочегоМеста(РабочееМесто)
Возврат(РабочееМесто.Код);
КонецФункции

&НаКлиенте
Процедура ПечатьТекущейСпецификации(Команда)
ОткрытьФорму("Отчет.ПечатьСпецификацииСУчётомАналогов.Форма.ФормаОтчета",Новый Структура("ПЗ",Объект.ПроизводственноеЗадание));
КонецПроцедуры

&НаСервере
Функция ЗавершитьНаСервере()
Запрос = Новый Запрос;

НовоеРабочееМесто = ОбщийМодульВызовСервера.ПолучитьСледующееРабочееМесто(Объект.РабочееМесто);
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	ДатаОкончания = ТекущаяДата();
	Парам = Новый Структура("РабочееМесто,Исполнитель,ДатаОкончания",Объект.РабочееМесто,Объект.Исполнитель,ДатаОкончания);
	ОбщийМодульРаботаСРегистрами.ИзменитьЭтапПроизводственногоЗадания(Объект.ПроизводственноеЗадание,Парам);
		Если Не НовоеРабочееМесто.Пустая() Тогда
		Парам = Новый Структура("РабочееМесто,Количество,ДатаНачала",НовоеРабочееМесто,Объект.ПроизводственноеЗадание.Количество,ДатаОкончания);
		ОбщийМодульРаботаСРегистрами.СоздатьЭтапПроизводственногоЗаданияКанбан(Объект.ПроизводственноеЗадание,Парам);
		Иначе
			Если Не ОбщийМодульСозданиеДокументов.СоздатьВыпускПродукцииКанбан(Объект.ПроизводственноеЗадание,ДатаОкончания) Тогда
			Сообщить("Документ выпуска по ПЗ "+Объект.ПроизводственноеЗадание.Номер+" не создан!");
			ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
			Возврат(Ложь);
			КонецЕсли;
		КонецЕсли;
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Возврат(Истина);
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	КонецПопытки;
Возврат(Ложь);
КонецФункции

&НаКлиенте
Процедура Завершить(Команда)
	Если Объект.ПроизводственноеЗадание.Пустая() Тогда
	Сообщить("Нет выбранного производственного задания!");
	Возврат;	
	КонецЕсли;
		Если Объект.РабочееМесто.Пустая() Тогда
		Сообщить("Не определено рабочее место!");
		Возврат;	
		КонецЕсли;
			Если Объект.Исполнитель.Пустая() Тогда
			Сообщить("Не определен исполнитель!");
			Возврат;	
			КонецЕсли;
				Если ЗавершитьНаСервере() Тогда	
				ОчиститьСсылкуНаПЗ();
				КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьПЗ(Значение)
Объект.ПроизводственноеЗадание = ЗначениеИзСтрокиВнутр(Значение); 
КонецПроцедуры

&НаСервере
Процедура ПолучитьИсполнителя(Данные)
Объект.Исполнитель = ЗначениеИзСтрокиВнутр(Данные);
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если ЭтаФорма.ВводДоступен() Тогда
	Массив = ОбщийМодульВызовСервера.РазложитьСтрокуВМассив(Данные,";");
		Если Массив[0] = "4" Тогда	
		ПолучитьПЗ(Массив[1]);
			Если Не Объект.ПроизводственноеЗадание.Пустая() Тогда
			ПроизводственноеЗаданиеПриИзмененииНаСервере();
			КонецЕсли;
		Иначе
	    ПолучитьИсполнителя(Данные);
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция МожноРаботатьВАРМ()
	Если ОбщийМодульВызовСервера.МожноВыполнить(Объект.РабочееМесто.Линейка) Тогда	
	Возврат(Истина);
	Иначе
	Объект.РабочееМесто = Справочники.РабочиеМестаЛинеек.ПустаяСсылка();
	Объект.ПроизводственноеЗадание = Документы.ПроизводственноеЗадание.ПустаяСсылка();
	Сообщить("Работа АРМ запрещена в этой базе!");
	Возврат(Ложь);
	КонецЕсли;
КонецФункции 

&НаСервере
Процедура ПроизводственноеЗаданиеПриИзмененииНаСервере()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.РабочееМесто
	|ИЗ
	|	РегистрСведений.ЭтапыПроизводственныхЗаданий.СрезПоследних КАК ЭтапыПроизводственныхЗаданийСрезПоследних
	|ГДЕ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ = &ПЗ
	|	И ЭтапыПроизводственныхЗаданийСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
Запрос.УстановитьПараметр("ПЗ", Объект.ПроизводственноеЗадание);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Объект.РабочееМесто = ВыборкаДетальныеЗаписи.РабочееМесто;
		Если Не МожноРаботатьВАРМ() Тогда
		Возврат;
		КонецЕсли;
	КонецЦикла;
		Если Объект.РабочееМесто.Пустая() Тогда
		ОчиститьСсылкуНаПЗ();
		Сообщить("Производство изделия по данному производственному заданию завершено!");
		КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПроизводственноеЗаданиеПриИзменении(Элемент)
ПроизводственноеЗаданиеПриИзмененииНаСервере();
КонецПроцедуры
